Update readme + mobile adaptive
